{"pages":[{"text":"Dr. Colin McLear Office: 1003 Oldfather Hall Office hours: On leave Fall 2015 Email: mclear@unl.edu Email is the best way to reach me. I answer emails on weekdays, usually within 24 hrs. Students, please check your syllabus before emailing your question. If it is covered in the syllabus I likely won't respond. If you would like a response, please adhere to these basic email etiquette guidelines: Remember to include your full name and course/section. Use a professional email address, such as your UNL email account, to send email, instead of an anonymous internet account. Include an informative subject line that summarizes the content of your email (e.g. \"Question about Assignment 3 for PHIL101 ″ instead of \"Question\"). Begin your email with an appropriate greeting (Dear/Hi/Hello [professor's name]). Keep the body of your email brief and to the point. If it's longer than a paragraph, consider arranging a meeting during office hours to discuss your issue instead. Are you emailing with a question a classmate could answer (about material missed when absent, for example)? If so, ask that classmate before contacting your professor. It's more efficient for everyone. Do not send personal/confidential information in an email; email is not secure. Keep your tone professional. Write in complete sentences and avoid text-speak. Note: If your email looks like this: \"hi prof r we doing anything important 2day? kthxbai!\" you are unlikely to receive a reply. End your email with a closing (Best/Thank you/Sincerely/etc.) and your first and last name. Remember to leave time to receive a response. Do not expect a reply over the weekend or at 3 am, for example. Learning to communicate professionally is a critical skill that will help you in your future job searches and careers. Now is a good time to start practicing!","tags":"pages","loc":"http://colinmclear.net/contact","title":"Contact"},{"text":"Philosophy Resources Some links for research, and for writing good philosophical prose. Stanford Encyclopedia of Philosophy Internet Encyclopedia of Philosophy PhilPapers KantPapers Kant in the Classroom Early Modern Philosophy Texts Philosophical Terms & Methods Jim Pryor's guides to reading and writing philosophy Purdue Online Writing Lab A Guide to Philosophical Writing Academic Technology & Tools Links to tools I use for research and writing Markdown : Plaintext markup for easy writing Pandoc : File conversion Sublime Text : Superb text editor BibDesk : Reference manager Skim : PDF reader & annotator Git : Version control Github : Online storage and collaboration Kieran Healy's writing resources page Profhacker : Blog on teaching & technology The Programming Historian : Tutorials for aspiring digital humanists","tags":"pages","loc":"http://colinmclear.net/resources","title":"Resources"},{"text":"Though I have quite general interests in the history of seventeenth and eighteenth century European philosophy, my work mostly focuses on issues pertaining to Immanuel Kant's philosophy of mind, perception, his theory of human reason and rationality, and the broader metaphysical and epistemological views with which these ideas are integrated. I'm also very interested in seeing what, if any, connections may be made between Kant's positions and contemporary research programs in philosophy of mind and metaphysics. Publications \" Kant on Perceptual Content,\" forthcoming in Mind . (Preprint) \" Two Kinds of Unity in the Critique of Pure Reason ,\" Journal of the History of Philosophy , Vol. 53, no. 1. January 2015, pp. 79-110. (Postprint) \" The Kantian (Non)-Conceptualism Debate,\" Philosophy Compass , Vol. 9, no. 11. November 2014, pp. 769-90. doi: 10.1111/phc3.12166 . (Preprint) \" Kant on Animal Consciousness,\" Philosophers' Imprint , Vol. 11, no.15. November 2011, pp. 1-16. \" Three Skeptics and the Critique : Critical Notice of Michael Forster's Kant and Skepticism ,\" with Andrew Chignell. Philosophical Books , Vol. 51, no. 4. October 2010, pp. 228-244. Upcoming Conferences & Presentations May 1-2, 2015: Organizer, UNL Chambers Philosophy Conference – Kant on Introspection, Self-Consciousness, & Self-Knowledge April 2, 2015: Pacific APA , Vancouver - \"Definition and Essence in the Metaphysical Foundations of Natural Science \" January 16, 2015: Workshop on Kant and the Mind, Oxford University - \"Comments on Stefanie Grüne on the Object-Dependence of Intuition\" October 25-6, 2014: Midwest Study Group of the North American Kant Society, Washington University in St. Louis – \"Intuition and Presence\" October 3-5, 2014: Kantian Freedom, Simon Fraser University – \"Priority Monism, Intuition, and Freedom\" August 23, 2014: UK Kant Society Annual Conference, Oxford University – \"Definition and Essence in the Metaphysical Foundations of Natural Science \" Other Work Comments on Stefanie Grüne's Blinde Anschauung , Author meets critics session of Critique . ( PDF version ) Work in Progress If you're interested in a draft of any of the following please email me . \" Intuition and Presence\" \" Definition and Essence in the Metaphysical Foundations of Natural Science \" \" Animals and Objectivity\" \" Strands of Subjectivity: Kant on Presentation and Projection\"","tags":"pages","loc":"http://colinmclear.net/research","title":"Research"},{"text":"I regularly teach Introduction to Philosophy, an undergraduate survey of ‘modern' philosophy of the seventeenth and eighteenth centuries, and graduate level courses on Kant and related topics. Spring 2016 (On leave Fall 2015) PHIL 232: History of Modern Philosophy PHIL 971: Introspection & Self-Knowledge Previously Taught PHIL 101: Introduction to Philosophy PHIL 971: Seminar on Conceptualism PHIL 871: Kant's Critical Philosophy","tags":"pages","loc":"http://colinmclear.net/teaching","title":"Teaching"},{"text":"I've update the website with (what I hope is) a cleaner look and a bit better navigation. Thanks go to DandyDev for developing a great bootstrap theme for Pelican . I'll be continuing to tweak here and there so apologies if you find broken links or other infelicities.","tags":"blog","loc":"http://colinmclear.net/2015/new-site-design.html","title":"New site design"}]}